In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["Amit", "Neha", "Rahul", "Priya"],
    "Age": [25, 23, 28, 24],
    "City": ["Delhi", "Mumbai", "Bangalore", "Pune"],
    "Salary": [50000, 48000, 60000, 52000]
}
df = pd.DataFrame(data)
df

    Name  Age       City  Salary
0   Amit   25      Delhi   50000
1   Neha   23     Mumbai   48000
2  Rahul   28  Bangalore   60000
3  Priya   24       Pune   52000

In [3]:
df[df['Age']>25]

    Name  Age       City  Salary
2  Rahul   28  Bangalore   60000

In [6]:
df

    Name  Age       City  Salary
0   Amit   25      Delhi   50000
1   Neha   23     Mumbai   48000
2  Rahul   28  Bangalore   60000
3  Priya   24       Pune   52000

In [14]:
df[(df["Age"] > 25) & (df["City"] == "Bangalore")]

    Name  Age       City  Salary
2  Rahul   28  Bangalore   60000